reports/static.txt
Running 5s test @ http://localhost:8000/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.02ms  324.20us   8.55ms   78.77%
    Req/Sec     6.63k   362.07     7.40k    77.65%
  336738 requests in 5.10s, 47.53MB read
  Socket errors: connect 0, read 59, write 0, timeout 0
Requests/sec:  66008.68
Transfer/sec:      9.32MB